# language: ru
Функционал: Авторизация пользователя
  Как пользователь сайта, я должен иметь возможность
  регистрироваться, входить в аккаунт и выходить из него.

  @register
  Сценарий: Регистрация
    Допустим я нахожусь на странице "register"
    И ввожу в поле "Телефон" значение "0555555444"
    И ввожу в поле "Почта" значение "john2@gmail.com"
    И ввожу в поле "Пароль" значение "12345"
    И ввожу в поле c датой рождения значение "19.01.2006"
    И ввожу в поле "ФИО" значение "Джонни Кейдж"
    И в поле "Пол" выбираю "Мужской"
    И в поле "Категория" выбираю "Masters"
    И в поле "Ознакомился с правилами КСЛТ" кликаю на галочку в чекбоксах.
    И в поле "Даю согласие на обработку персональных данных" кликаю на галочку в чекбоксах.
    И нажимаю на кнопку "Зарегистрироваться"
    Тогда проверить что я в аккаунте


  @login
  Сценарий: Логин
    Допустим я нахожусь на странице "login"
    И ввожу в поле "Телефон" значение "0999999999"
    И ввожу в поле "Пароль" значение "123qwe"
    И нажимаю на кнопку "Войти"
    Тогда проверить что я в аккаунте

  @logout
  Структура сценария: Логаут на мобильном и десктопном экране
    Допустим я авторизован на сайте
    И я должен быть на главной странице
    И я изменяю размер окна на <width> и <height> и нажимаю на иконку пользователя в хедере
    Когда я нажимаю на кнопку "Выйти" на размерах <width> и <height>
    Тогда я должен быть перенаправлен на главную страницу и видеть ссылку на авторизацию

    Примеры:
      | width | height |
      | 375   | 667    |
      | 1280  | 800    |
