# language: ru
Функционал: Управление каруселью на главной странице
  Как администратор сайта
  Я хочу иметь возможность добавлять, удалять и редактировать файлы в карусели
  Чтобы поддерживать актуальность и привлекательность контента на главной странице.

  @add-image-in-carousel
  Сценарий: Добавить в карусель изображение
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Карусель"
    Тогда нажимаю на кнопку "Добавить файл"
    И я загружаю файл "public/filesCarousel/testImage.png"
    Когда я кликаю на кнопку с инконкой в котором есть дата "add-file-in-carousel"
    И если я вижу текст "Файл успешно выложен" то тест успешно завершен