# language: ru
Функционал: Работа администратора с категориями
  Как админ сайта я могу создать, удалять и
  редактировать ссылки на элементы в подвале сайта.

  @add-category
  Сценарий: Cоздание категории
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Категории"
    И нажимаю на кнопку "Добавить категорию"
    И ввожу в поле "Название" значение "Test category"
    И нажимаю на кнопку "Добавить"
    И если я вижу текст "Категория успешно добавлена." то тест успешно завершен


  @edit-category
  Сценарий: Отредактировать категорию
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Категории"
    И я вижу карточку категории, у которой внутри есть текст "Test category"
    И нажимаю на кнопку редактировать у категории "Test category"
    И вижу поле "Название" с текстом "Test category"
    И ввожу в поле "Название" значение "Masters"
    Затем вижу текст "Категория Masters уже существует."
    И ввожу в поле "Название" значение "Test"
    И нажимаю на кнопку "Редактировать"
    И если я вижу текст "Категория успешно отредактирована." то тест успешно завершен

  @delete-category
  Сценарий: Удалить категорию
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Категории"
    И я вижу карточку категории, у которой внутри есть текст "Test"
    И нажимаю на кнопку удалить у категории "Test"
    И нажимаю на кнопку "Удалить"

