# language: ru

Функционал: Работа администратора с подвалом сайта
  Как админ сайта я могу создать, удалять и
  редактировать ссылки на элементы в подвале сайта.

# Сценарий CRUD элемента социальной сети.

  @add-social-network-icon
  Сценарий: Добавить социальную сеть
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Добавить социальную сеть"
    И я нажимаю на текст "Выберите социальную сеть" и в поле выбираю "Email"
    И ввожу в поле "Введите адрес электронной почты" значение "admin@gmail.com"
    Тогда нажимаю на кнопку "Добавить"
    Тогда в футер я вижу иконку у которой ссылка "admin@gmail.com"

  @edit-social-network-icon
  Сценарий: Отредактировать социальную сеть
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    И я вижу иконку "Facebook"
    И я нажимаю на кнопку редактирования иконки "Facebook"
    И ввожу в поле "Введите URL социальной сети" значение "https://www.facebook.com"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "Социальная сеть успешно обновлена." то тест успешно завершен


  @delete-social-network-icon
  Сценарий: Удалить социальную сеть
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    И я вижу иконку "Telegram"
    И я нажимаю на кнопку удалить иконки "Telegram"
    Тогда нажимаю на кнопку "Удалить"
    Тогда в футер я не вижу иконку у которой есть ссылка "https://t.me/+OAAcVaEu2oozNGZi"

# Сценарий CRUD элемента меню положения.

  @add-menu-position
  Сценарий: Добавить меню положение
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Меню положение"
    Тогда нажимаю на кнопку "Добавить пункт в положение"
    И ввожу в поле "Введите название пункта" значение "Условия участия в сообществе КСЛТ"
    И ввожу в поле "Введите адрес ссылки на страницу" значение "https://google.com"
    Тогда нажимаю на кнопку "Добавить"
    Тогда если я вижу текст "Пункт в меню успешно добавлен." то тест успешно завершен

  @edit-menu-position
  Сценарий: Отредактировать меню положение
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Меню положение"
    И я вижу карточку у которой внутри есть текст "Положение КСЛТ"
    И я нажимаю на кнопку редактирования меню положения "Положение КСЛТ"
    И ввожу в поле "Введите название пункта" значение "Новое положение КСЛТ"
    И ввожу в поле "Введите адрес ссылки на страницу" значение "https://new.google.com"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "Новое положение КСЛТ" то тест успешно завершен

  @delete-menu-position
  Сценарий: Удалить меню положение
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Меню положение"
    И я вижу карточку у которой внутри есть текст "Дисциплинарное положение КСЛТ"
    И я нажимаю на кнопку удаления меню положения "Дисциплинарное положение КСЛТ"
    Тогда нажимаю на кнопку "Удалить"
    Тогда если я не вижу текст "Дисциплинарное положение КСЛТ" то тест успешно завершен

# Сценарий UPDATE элемента публичная оферта.

  @edit-public-offer
  Сценарий: Отредактировать публичную оферту
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Публичная оферта"
    Тогда нажимаю на кнопку "Изменить публичную оферту"
    И ввожу в поле "Введите URL публичной оферты" значение "https://new.public-offer.ru"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда в футере я вижу обновленную ссылку на публичную оферту "https://new.public-offer.ru"

# Сценарий UPDATE элемента генеральный партнер.

  @edit-general-partner
  Сценарий: Отредактировать изображение генерального партнера
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Ген.партнер"
    Тогда нажимаю на кнопку "Изменить ген.партнера"
    И я обновлению изображение генерального партнера
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "Изображение успешно обновлено." то тест успешно завершен