# language: ru
Функционал: Управление лого на главной странице
  Как администратор сайта
  Я хочу иметь возможность добавлять, удалять и редактировать лого на главной странице
  Чтобы поддерживать актуальность и привлекательность контента на главной странице.

  @add-logo-header
  Сценарий: Создать лого
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Главное лого"
    Тогда нажимаю на кнопку "Добавить лого"
    И я загружаю файл "public/filesCarousel/testVideo.MP4"