# language: ru
Функционал: Управление лого на главной странице
  Как администратор сайта
  Я хочу иметь возможность добавлять, удалять и редактировать лого на главной странице
  Чтобы поддерживать актуальность и привлекательность контента на главной странице.

  @add-logo-header
  Сценарий: Создать лого
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Главное лого"
    Тогда нажимаю на кнопку "Добавить лого"
    И я загружаю файл "public/test-logo.png"
    Когда я кликаю на кнопку с инконкой в котором есть дата "add-logo-header"
    И если я вижу текст "Лого успешно выложено" то тест успешно завершен

  @update-logo-header
  Сценарий: Заменить лого из админ панели
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Главное лого"
    Когда я кликаю на кнопку с инконкой в котором есть дата "update-logo-header"
    И если я вижу текст "Логотип успешно заменен" то тест успешно завершен

  @delete-logo-header
  Сценарий: Удалить лого из админ панели
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Подвал сайта"
    Тогда нажимаю на кнопку "Главное лого"
    Когда я кликаю на кнопку с инконкой в котором есть дата "delete-logo-header"
    Тогда нажимаю на кнопку "Удалить"
    И если я вижу текст "Логотип успешно удален" то тест успешно завершен


