# language: ru
Функционал: Управление новостями
  Как администратор сайта
  Я хочу иметь возможность добавлять, удалять и редактировать файлы в новостях

  @add-news
  Сценарий: Добавить новость
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Новости"
    Затем нажимаю на кнопку "Добавить новость"
    И ввожу в поле "Заголовок новости" значение "Тестовая новость"
    И ввожу в поле "Подзаголовок новости" значение "Это тестовая новость"
    И ввожу в поле c дивом "Содержание новости..." значение "Контент новости"
    Затем я ввожу файл "public/filesNews/female-tennis-player.jpg" в поле "Обложка новости"
    И вижу изображение с alt "News cover preview"
    Затем я ввожу файл "public/filesNews/tennis-ball.jpg" в поле "Изображения новости"
    Затем я ввожу файл "public/filesNews/tennis-player.jpg" в поле "Изображения новости"
    Затем я ввожу файл "public/filesNews/female-tennis-player.jpg" в поле "Изображения новости"
    И вижу изображение с alt "NewsPage Image 1"
    И вижу изображение с alt "NewsPage Image 2"
    И вижу изображение с alt "NewsPage Image 3"
    Затем я могу удалить изображение с alt "NewsPage Image 3" нажав на кнопку с "remove-carousel-image 3"
    И я больше не вижу изображение с alt "NewsPage Image 3"
    И нажимаю на кнопку "Создать"
    И если я вижу текст "Новость успешно добавлена!" то тест успешно завершен

  @unauthorized-news-view
  Сценарий: Просмотр новости неавторизованным пользователем
    Допустим я нахожусь на странице "news"
    И я вижу карточку новости с текстом "Winter Gold Cup 2021"
    И нажимаю на карточку новости "Winter Gold Cup 2021"
    Затем вижу блок изображений новости "news-images"
    И могу нажать на изображение с alt "Slide 1"
    Затем мне выходит модальное окно "news-images-modal" с изображением "Image 0"
    И могу перелистывать изображения в модальном окне, нажав на кнопку "carousel-next", я вижу изображение "Image 1"
    Затем я закрываю модальное окно нажав на кнопку "close-modal"
    И вижу заголовок новости "Winter Gold Cup 2021"
    Затем я нахожусь на странице "news"
    И нажимаю на кнопку фильтрации новостей "news-start-date"
    Затем я выбираю "1" день "декабрь" месяца
    И нажимаю на кнопку фильтрации новостей "news-end-date"
    Затем я выбираю "последний" день "декабрь" месяца
    И если месяц "декабрь", то я вижу карточку новости с текстом "Кубок Ролан Гаррос 2024"
    Затем я сбрасываю фильтры, нажав на "news-reset-date"
    И я вижу карточку новости с текстом "Winter Gold Cup 2021"

  @update-news
  Сценарий: Отредактировать новость
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Новости"
    И я вижу карточку новости с текстом "День открытых дверей в Академии тенниса"
    Тогда нажимаю на кнопку редактирования новости "День открытых дверей в Академии тенниса"
    И ввожу в поле "Заголовок новости" значение "Тест редактирования"
    И ввожу в поле "Подзаголовок новости" значение "Измененный подзаголовок"
    И ввожу в поле c дивом "Содержание новости..." значение "Обновленный контент новости"
    Затем я ввожу файл "public/filesNews/female-tennis-player.jpg" в поле "Обложка новости"
    И вижу изображение с alt "News cover preview"
    И нажимаю на кнопку "Редактировать"
    И если я вижу текст "Новость успешно обновлена!" то тест успешно завершен

  @delete-news
  Сценарий: Удалить новость
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Новости"
    И я вижу карточку новости с текстом "Финал ATP 2024"
    Тогда нажимаю на кнопку удаления новости "Финал ATP 2024"
    Затем если я вижу текст "Новость успешно удалена!" то тест успешно завершен
