# language: ru
Функционал: Рейтинги
  Как пользователь сайта, я должен иметь возможность
  просмотреть рейтинги и события, связанные с ними.

  @add-rating
  Сценарий: Cоздание рейтинга
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Рейтинги"
    И нажимаю на кнопку "Добавить рейтинг"
    И ввожу в поле "Год" значение "2020"
    И в поле "Раздел" выбираю "Мужской"
    И нажимаю на кнопку "Добавить"

  @add-event
  Сценарий: Добавить событие в рейтинг
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Рейтинги"
    И нажимаю на кнопку "Добавить событие"
    И ввожу в поле "Категория" значение "ProMasters"
    И ввожу в поле "Разряд" значение "II"
    И в поле "Рейтинг" выбираю "2024"
    И ввожу в поле "Ссылка" значение "https://www.checks.com/"
    И нажимаю на кнопку "Сохранить"

  @edit-event
  Сценарий: Редактировать событие
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Рейтинги"
    И я вижу карточку с годом "2024"
    И нажимаю на кнопку редактировать у события
    И ввожу в поле "Категория" значение "ProMasters"
    И ввожу в поле "Разряд" значение "II"
    И в поле "Рейтинг" выбираю "2024"
    И ввожу в поле "Ссылка" значение "https://www.check.com/"
    И нажимаю на кнопку "Сохранить"
    И если я вижу текст "Событие успешно отредактировано" то тест успешно завершен

  @delete-event
  Сценарий: Удалить событие
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Рейтинги"
    И я вижу карточку с годом "2024"
    И нажимаю на кнопку удалить у события
    И нажимаю на кнопку "Удалить"
    И если я вижу текст "Событие успешно удалено" то тест успешно завершен

  @delete-rating
  Сценарий: Удалить рейтинг
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Рейтинги"
    И нажимаю на кнопку удалить у рейтинга
    И нажимаю на кнопку "Удалить"
    И если я вижу текст "Рейтинг успешно удален" то тест успешно завершен