# language: ru

Функционал: Работа с пользователями
  Как админ сайта я могу создать, удалять и
  редактировать участников в топах рейтинга и редактировать категории рейтингов.

  @edit-rating-category
  Сценарий: Редактирование категории рейтинга
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Топ Игроки"
    И нажимаю на кнопку "Изменить категории"
    И ввожу в поле "Введите категорию для мужского топ-8" значение "ProMasters"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "Категории рейтингов обновлены успешно" то тест успешно завершен

  @create-rating-member
  Сценарий: Создание участника топа
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Топ Игроки"
    И нажимаю на кнопку "Добавить в мужской рейтинг"
    И в поле "Топ" выбираю "Топ-8"
    Тогда если я вижу текст "Предупреждение: Максимальное количество участников для Топ-8 мужского рейтинга уже добавлено. Вы можете удалить или редактировать участников, но не добавлять новых." то тест успешно завершен

  @delete-rating-member
  Сценарий: Удаление участника из топа
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Топ Игроки"
    И я вижу карточку с текстом "Leslie Alexander"
    И я нажимаю на кнопку удаления в карточке участника рейтинга "Leslie Alexander"
    Тогда нажимаю на кнопку "Удалить"
    Тогда если я вижу текст "Удаление прошло успешно!" то тест успешно завершен

  @edit-rating-member
  Сценарий: Редактирование участника топа
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Топ Игроки"
    И я вижу карточку с текстом "Wade Warren"
    И я нажимаю на кнопку редактирования в карточке участника рейтинга "Wade Warren"
    И ввожу в поле "Введите имя участника" значение "Wade Warren test"
    И в поле "Место" выбираю "5"
    Тогда нажимаю на кнопку "Редактировать"
    Тогда если я вижу текст "Участник рейтинга обновлен успешно" то тест успешно завершен
    Тогда если я вижу текст "Обнаружены дублирующиеся места в Топ-8 мужского рейтинга. Проверьте данные." то тест успешно завершен