# language: ru

Функционал: Календарь
  Как пользователь сайта, я должен иметь возможность
  просмотреть турниры в календаре в соответствии с предоставленным доступом.
  Как админ сайта я могу создать, удалять и
  редактировать турниры в календаре.

  @unauthorized-tournament-view
  Сценарий: Просмотр турнира неавторизованным пользователем
    Допустим я нахожусь на странице календаря
    И нажимаю на кнопку "Январь"
    И я вижу карточку с текстом "January Open"
    И я нажимаю на кнопку "Результаты Турнира" в карточке турнира
    Тогда если я вижу текст "Этот функционал доступен только для зарегистрированных пользователей. Пожалуйста, войдите или зарегистрируйтесь, чтобы получить доступ." то тест успешно завершен
    И я нажимаю на кнопку "Регламент Турнира" в карточке турнира
    Тогда если я вижу текст "Этот функционал доступен только для зарегистрированных пользователей. Пожалуйста, войдите или зарегистрируйтесь, чтобы получить доступ." то тест успешно завершен

  @authorized-tournament-view
  Сценарий: Просмотр турнира авторизованным пользователем
    Допустим я авторизован на сайте
    Тогда нажимаю на кнопку "Календарь"
    И нажимаю на кнопку "Январь"
    И я вижу карточку с текстом "January Open"
    И я вижу кнопку 'Результаты Турнира' с атрибутом href

  @create-tournament
  Сценарий: Создание турнира
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда я нажимаю на кнопку в админ панели "Календарь"
    И нажимаю на кнопку "Создать турнир"
    И ввожу в поле "Название турнира" значение "Test tournamnet Cup"
    И ввожу в поле "Количество участников" значение "20"
    И нажимаю на кнопку "Выберите дату"
    И выбираю дату турнира "14 январь" в календаре
    И ввожу в поле "Категория турнира" значение "Masters"
    И в поле "Разряд" выбираю "Микст"
    И ввожу в поле "Ссылка для регистрации" значение "https://www.google.com"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "Турнир создан успешно" то тест успешно завершен

  @delete-tournament
  Сценарий: Удаление турнира
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда я нажимаю на кнопку в админ панели "Календарь"
    И нажимаю на кнопку "Январь"
    И я вижу карточку с текстом "January Open"
    И я нажимаю на кнопку удаления в карточке турнира "January Open"
    Тогда нажимаю на кнопку "Удалить"
    Тогда если я вижу текст "Удаление прошло успешно!" то тест успешно завершен

  @edit-tournament
  Сценарий: Редактирование турнира
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда я нажимаю на кнопку в админ панели "Календарь"
    И нажимаю на кнопку "Январь"
    И я вижу карточку с текстом "Mixed Doubles Classic"
    И я нажимаю на кнопку редактирования в карточке турнира "Mixed Doubles Classic"
    И ввожу в поле "Название турнира" значение "Mixed Doubles Classic Test"
    И ввожу в поле "Количество участников" значение "17"
    Тогда нажимаю на кнопку "Редактировать"
    Тогда если я вижу текст "Турнир обновлен успешно" то тест успешно завершен