# language: ru

Функционал: Работа с пользователями
  Как админ сайта я могу создать, редактировать, деактивировать пользователей,
  а также фильтровать их по данным ФИО, номера или категории.

  @filter-users
  Сценарий: Фильтрация пользователей
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Список пользователей"
    И ввожу в поле "Поиск по ФИО…" значение "User 4"
    Тогда если я вижу текст "user4@example.com" то тест успешно завершен
    Тогда нажимаю на кнопку "Сбросить"
    И ввожу в поле "Поиск по номеру телефона…" значение "0999"
    Тогда если я вижу текст "Alice Doe" то тест успешно завершен
    Тогда нажимаю на кнопку "Сбросить"
    Когда выбираю категорию "ProMasters" в селекте
    Тогда если я вижу текст "Alice Doe" то тест успешно завершен

  @create-moderator
  Сценарий: Создание модератора
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Список пользователей"
    И нажимаю на кнопку "Добавить пользователя"
    И ввожу в поле "Введите ваше полное ФИО" значение "Лариса Гузеева"
    И ввожу в поле "0500 000 000" значение "0559 110 080"
    И ввожу в поле "example@gmail.com" значение "lara@gmail.com"
    И ввожу в поле "Введите пароль" значение "100"
    И нажимаю на кнопку "Выберите дату"
    И выбираю дату рождения "5 май 2004" в календаре
    И в поле "Пол" выбираю "Женский"
    И в поле "Категория" выбираю "Masters"
    И в поле "Роль" выбираю "Модератор"
    Тогда нажимаю на кнопку "Добавить"
    Тогда если я вижу текст "Профиль успешно создан" то тест успешно завершен
    Тогда нажимаю на кнопку "Модераторы"
    И я вижу запись пользователя с текстом "Лариса Гузеева"

  @create-user
  Сценарий: Создание пользователя
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Список пользователей"
    И нажимаю на кнопку "Добавить пользователя"
    И ввожу в поле "Введите ваше полное ФИО" значение "Василий Пупкин"
    И ввожу в поле "0500 000 000" значение "0559 110 666"
    И ввожу в поле "example@gmail.com" значение "vasyapupa@gmail.com"
    И ввожу в поле "Введите пароль" значение "000"
    И нажимаю на кнопку "Выберите дату"
    И выбираю дату рождения "5 май 2004" в календаре
    И в поле "Пол" выбираю "Мужской"
    И в поле "Категория" выбираю "Masters"
    И в поле "Роль" выбираю "Пользователь"
    Тогда нажимаю на кнопку "Добавить"
    Тогда если я вижу текст "Профиль успешно создан" то тест успешно завершен

  @deactivate-user
  Сценарий: Деактивирование пользователя
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Список пользователей"
    И я вижу запись пользователя с текстом "User 3"
    И я нажимаю на кнопку деактивации в записи пользователя "User 3"
    Тогда если я вижу кнопку активации у пользователя "User 3" то тест успешно завершен

  @edit-user
  Сценарий: Редактирование пользователя
    Допустим я авторизован на сайте
    И я должен быть в административной панели
    Тогда нажимаю на кнопку "Список пользователей"
    И я вижу запись пользователя с текстом "User 1"
    И я нажимаю на кнопку редактирования в записи пользователя "User 1"
    И ввожу в поле "Введите ваше полное ФИО" значение "User 1 test"
    Тогда нажимаю на кнопку "Сохранить"
    Тогда если я вижу текст "User 1 test" то тест успешно завершен
